

// 문제1 273, 52 2개의 숫자에 제시된다. 
// 2개의 숫자를 각각 *, % 계산하는 결과를 작성하는 코드를 문제해결 시나리오 이용해서 작성하세요
// let num1 = 273;
// let num2 = 52;

// console.log(273 * 52);
// console.log(273 % 52);

// 문제 2 
// 입력1 : "안녕하세요"
// 입력2 : "홍길동입니다."
// 결과  : "안녕하세요 홍길동입니다."
// 위의 결과를 출력하는 코딩을 문제해결 시나리오를 이용해서 작성하세요
// let str1 = prompt("입력 1");
// let str2 = prompt("입력 2");
// console.log(str1 + " " +str2);

// 문제3
// 19살이면 성인입니다 출력하는 코딩을 문제해결 시나리오를 이용해서 작성하세요
// let age = Number(prompt("나이를 입력하세요"));
// if(age >= 19) {
//     console.log("성인입니다.");
// }

// 문제4
// 19살이면 성인입니다 를 출력하고, 18살이면 청소년입니다, 17살 이하면 미성년입니다. 를 출력하는 코딩을 문제해결 시나리오를 이용해서 작성하세요
// let age = Number(prompt("나이를 입력하세요"));
// if(age >= 19) {
//     alert("성인입니다.");
// } else if(age === 18){
//     alert("청소년입니다.")
// } else {
//     alert("미성년입니다.")
// }

// 문제5
// 1 ~10 까지 모든 숫자를 더해서 최종 결과를 출력하는 코드를 문제해결 시나리오를 이용해서 작성하세요

// let result = 0;
// for(let i = 1; i <= 10; i++) {
//     result += i;
// }
// console.log(result);